[
  {
    "person": "Crush 1",
    "message": "I must be dreaming, because I just saw an angel in front of me.",
    "message_urdu": "شاید میں خواب دیکھ رہا ہوں، کیونکہ ابھی میں نے اپنے سامنے ایک فرشتہ دیکھا۔"
  },
  {
    "person": "Crush 2",
    "message": "Oh really? I thought you were just staring at me because I’m so irresistible.",
    "message_urdu": "واقعی؟ مجھے لگا تم مجھے بس اس لیے گھوم کر دیکھ رہے تھے کیونکہ میں اتنا پرکشش ہوں۔"
  },
  {
    "person": "Crush 1",
    "message": "Well, you’re right about that. Can’t stop thinking about you.",
    "message_urdu": "تم ٹھیک کہہ رہے ہو۔ تمہارے بارے میں سوچنے سے روک نہیں پا رہا۔"
  },
  {
    "person": "Crush 2",
    "message": "You should stop thinking about me, or else you might fall for me.",
    "message_urdu": "تمہیں میرے بارے میں سوچنا چھوڑ دینا چاہیے، ورنہ تم مجھ پر فدا ہو جاؤ گے۔"
  },
  {
    "person": "Crush 1",
    "message": "I think I already have. Is that a problem?",
    "message_urdu": "مجھے لگتا ہے کہ میں پہلے ہی تم پر فدا ہو چکا ہوں۔ کیا یہ کوئی مسئلہ ہے؟"
  },
  {
    "person": "Crush 2",
    "message": "Not at all, but I hope you’re ready for the adventure that comes with it.",
    "message_urdu": "بالکل نہیں، مگر مجھے امید ہے کہ تم اس کے ساتھ آنے والی مہم کے لیے تیار ہو۔"
  },
  {
    "person": "Crush 1",
    "message": "I’ve been ready for a while. Just waiting for the right person to come along.",
    "message_urdu": "کافی دیر سے تیار ہوں۔ بس صحیح شخص کا انتظار کر رہا تھا۔"
  },
  {
    "person": "Crush 2",
    "message": "Well, lucky for you, I just happened to show up.",
    "message_urdu": "خوش قسمتی سے، میں بس آ گیا ہوں۔"
  },
  {
    "person": "Crush 1",
    "message": "I must say, my timing is impeccable.",
    "message_urdu": "مجھے کہنا پڑے گا، میرا وقت بے مثال ہے۔"
  },
  {
    "person": "Crush 2",
    "message": "It sure is. I’m glad you’re here.",
    "message_urdu": "بالکل۔ مجھے خوشی ہے کہ تم یہاں ہو۔"
  },
  {
    "person": "Crush 1",
    "message": "I’ve been thinking… maybe we should hang out sometime, just the two of us.",
    "message_urdu": "میں سوچ رہا تھا… شاید کبھی ہم دونوں اکیلے ملیں؟"
  },
  {
    "person": "Crush 2",
    "message": "I’d love that. When should I clear my schedule for you?",
    "message_urdu": "مجھے یہ بہت پسند آئے گا۔ تمہارے لیے کب اپنا شیڈول خالی کروں؟"
  },
  {
    "person": "Crush 1",
    "message": "How about this weekend? I promise I’ll make it worth your while.",
    "message_urdu": "یہ ہفتہ کیسا رہے گا؟ وعدہ کرتا ہوں کہ تمہارے لیے یہ وقت قیمتی ہوگا۔"
  },
  {
    "person": "Crush 2",
    "message": "I’m intrigued. You better not disappoint me.",
    "message_urdu": "مجھے تجسس ہو رہا ہے۔ تمہیں مجھے مایوس نہیں کرنا چاہیے۔"
  },
  {
    "person": "Crush 1",
    "message": "Oh, I won’t. Just wait and see.",
    "message_urdu": "نہیں کروں گا۔ بس دیکھنا۔"
  },
  {
    "person": "Crush 2",
    "message": "I’m counting down the days already.",
    "message_urdu": "میں پہلے ہی دن گن رہا ہوں۔"
  },
  {
    "person": "Crush 1",
    "message": "You know, I think I could get used to having you around.",
    "message_urdu": "تمہیں ساتھ دیکھ کر لگتا ہے کہ میں عادی ہو سکتا ہوں۔"
  },
  {
    "person": "Crush 2",
    "message": "Careful, I might start getting used to you too.",
    "message_urdu": "احتیاط کرنا، مجھے بھی تمہاری عادت ہو سکتی ہے۔"
  },
  {
    "person": "Crush 1",
    "message": "That sounds like a dangerous thought.",
    "message_urdu": "یہ تو خطرناک خیال لگتا ہے۔"
  },
  {
    "person": "Crush 2",
    "message": "Maybe, but sometimes, danger is the most fun part.",
    "message_urdu": "شاید، مگر کبھی کبھار، خطرہ سب سے زیادہ مزہ آتا ہے۔"
  },
  {
    "person": "Crush 1",
    "message": "You’re absolutely right. I’m looking forward to seeing where this goes.",
    "message_urdu": "تم بالکل درست کہہ رہے ہو۔ میں دیکھنے کے لیے بے تاب ہوں کہ یہ کہاں جاتا ہے۔"
  },
  {
    "person": "Crush 2",
    "message": "Me too. But for now, let’s just enjoy the moment.",
    "message_urdu": "میں بھی۔ مگر ابھی کے لیے، بس لمحے کو انجوائے کرتے ہیں۔"
  }
]
