[
  {
    "person": "Partner 1",
    "message": "You are the poem I never knew how to write, but always felt in my heart.",
    "message_urdu": "تم وہ نظم ہو جسے میں کبھی نہیں لکھ سکا، مگر ہمیشہ دل میں محسوس کی تھی۔"
  },
  {
    "person": "Partner 2",
    "message": "And you, my love, are the rhythm in the verses of my soul.",
    "message_urdu": "اور تم، میری محبت، میری روح کے اشعار میں ساز ہو۔"
  },
  {
    "person": "Partner 1",
    "message": "Every moment with you is a verse, and our love is the sweetest rhyme.",
    "message_urdu": "تمہارے ساتھ ہر لمحہ ایک مصرعہ ہے، اور ہماری محبت سب سے میٹھی قافیہ ہے۔"
  },
  {
    "person": "Partner 2",
    "message": "In your eyes, I find the stars, and in your smile, the moonlight.",
    "message_urdu": "تمہاری آنکھوں میں میں ستارے پاتا ہوں، اور تمہاری مسکراہٹ میں چاندنی۔"
  },
  {
    "person": "Partner 1",
    "message": "With every word, you make my heart beat faster. It's as if you are poetry itself.",
    "message_urdu": "ہر لفظ کے ساتھ تم میرا دل تیز دھڑکاتے ہو۔ ایسا لگتا ہے جیسے تم خود ایک نظم ہو۔"
  },
  {
    "person": "Partner 2",
    "message": "And your love is the melody I hum, the song of my heart.",
    "message_urdu": "اور تمہاری محبت وہ دھن ہے جو میں گنگناتا ہوں، میرے دل کا گانا۔"
  },
  {
    "person": "Partner 1",
    "message": "Your love is the ink, my soul is the paper, and together we write our story.",
    "message_urdu": "تمہاری محبت سیاہی ہے، میری روح کاغذ ہے، اور ہم مل کر اپنی کہانی لکھتے ہیں۔"
  },
  {
    "person": "Partner 2",
    "message": "In the garden of your love, I bloom like a flower, lost in your fragrance.",
    "message_urdu": "تمہاری محبت کے باغ میں، میں ایک پھول کی طرح کھلتا ہوں، تمہاری خوشبو میں گم ہو جاتا ہوں۔"
  },
  {
    "person": "Partner 1",
    "message": "I am the silence before your words, the calm before your storm.",
    "message_urdu": "میں تمہارے الفاظ سے پہلے کی خاموشی ہوں، تمہاری طوفان سے پہلے کی سکون۔"
  },
  {
    "person": "Partner 2",
    "message": "And in your arms, I find my refuge, my world, my peace.",
    "message_urdu": "اور تمہاری بانہوں میں، مجھے پناہ ملتی ہے، میرا جہان، میرا سکون۔"
  },
  {
    "person": "Partner 1",
    "message": "You are my sunrise, my light, my hope that guides me through the dark.",
    "message_urdu": "تم میرا سورج چمک ہو، میری روشنی، میری امید ہو جو مجھے اندھیروں میں راستہ دکھاتی ہے۔"
  },
  {
    "person": "Partner 2",
    "message": "And you, my love, are the moon that lights up the night of my heart.",
    "message_urdu": "اور تم، میری محبت، وہ چاند ہو جو میرے دل کی رات کو روشن کرتا ہے۔"
  },
  {
    "person": "Partner 1",
    "message": "Every heartbeat whispers your name, a love song only the stars understand.",
    "message_urdu": "ہر دھڑکن تمہارا نام سرگوشی کرتی ہے، ایک محبت کا گانا جو صرف ستارے سمجھتے ہیں۔"
  },
  {
    "person": "Partner 2",
    "message": "And in the silence of the night, I hear your heart calling out to mine.",
    "message_urdu": "اور رات کی خاموشی میں، میں تمہارا دل میری طرف پکار رہا ہوتا ہے۔"
  },
  {
    "person": "Partner 1",
    "message": "With every kiss, we write a new chapter, and in your arms, I find my forever.",
    "message_urdu": "ہر بوسے کے ساتھ ہم ایک نیا باب لکھتے ہیں، اور تمہاری بانہوں میں مجھے میری ہمیشہ کی محبت ملتی ہے۔"
  },
  {
    "person": "Partner 2",
    "message": "You are the beginning and end of my every thought, the muse of my soul.",
    "message_urdu": "تم میری ہر سوچ کا آغاز اور اختتام ہو، میری روح کی الہام ہو۔"
  },
  {
    "person": "Partner 1",
    "message": "In this lifetime, in every lifetime, I’ll love you in ways words will never express.",
    "message_urdu": "اس زندگی میں، ہر زندگی میں، میں تم سے ایسی محبت کروں گا جو الفاظ کبھی نہیں بیان کر پائیں گے۔"
  },
  {
    "person": "Partner 2",
    "message": "Our love is a poem that will never end, a timeless story of forever.",
    "message_urdu": "ہماری محبت ایک ایسی نظم ہے جو کبھی ختم نہیں ہوگی، ہمیشہ کی ایک بے وقت کہانی۔"
  }
]
