[
  {
    "person": "Partner 1",
    "message": "I've been thinking a lot lately about us, about how perfect we are together.",
    "message_urdu": "میں حال ہی میں ہمارے بارے میں سوچ رہا ہوں، کہ ہم ایک ساتھ کتنے مکمل ہیں۔"
  },
  {
    "person": "Partner 2",
    "message": "I’ve been thinking the same. Every moment with you feels like a dream come true.",
    "message_urdu": "میں بھی یہی سوچ رہا ہوں۔ تمہارے ساتھ ہر لمحہ ایسا لگتا ہے جیسے خواب سچ ہو گئے ہوں۔"
  },
  {
    "person": "Partner 1",
    "message": "You know, I can’t imagine my life without you in it. You complete me.",
    "message_urdu": "تمہیں پتا ہے، میں اپنی زندگی تمہارے بغیر نہیں سوچ سکتا۔ تم مجھے مکمل کرتی ہو۔"
  },
  {
    "person": "Partner 2",
    "message": "I feel the same way. You're the best thing that's ever happened to me.",
    "message_urdu": "میں بھی ایسا ہی محسوس کرتا ہوں۔ تم میرے لیے سب سے بہترین چیز ہو جو کبھی بھی ہوئی۔"
  },
  {
    "person": "Partner 1",
    "message": "I know we have had our ups and downs, but I believe we are stronger because of them.",
    "message_urdu": "مجھے پتا ہے کہ ہمارے کچھ اچھے اور برے وقت رہے ہیں، مگر مجھے یقین ہے کہ ہم ان کی وجہ سے اور بھی مضبوط ہوئے ہیں۔"
  },
  {
    "person": "Partner 2",
    "message": "We have been through so much, and yet, here we are, stronger than ever.",
    "message_urdu": "ہم نے بہت کچھ ساتھ گزارا ہے، اور پھر بھی، ہم یہاں ہیں، پہلے سے زیادہ مضبوط۔"
  },
  {
    "person": "Partner 1",
    "message": "I want to spend the rest of my life with you. You are my one and only.",
    "message_urdu": "میں اپنی باقی زندگی تمہارے ساتھ گزارنا چاہتا ہوں۔ تم میری واحد ہو۔"
  },
  {
    "person": "Partner 2",
    "message": "I want the same. You mean everything to me. I can't imagine a future without you.",
    "message_urdu": "میں بھی یہی چاہتی ہوں۔ تم میری سب کچھ ہو۔ میں تمہارے بغیر اپنا مستقبل نہیں سوچ سکتی۔"
  },
  {
    "person": "Partner 1",
    "message": "Will you marry me? Will you be with me forever?",
    "message_urdu": "کیا تم مجھ سے شادی کرو گی؟ کیا تم ہمیشہ میرے ساتھ رہو گی؟"
  },
  {
    "person": "Partner 2",
    "message": "Yes, a thousand times yes! I would love to spend my life with you.",
    "message_urdu": "ہاں، ہزار بار ہاں! میں اپنی زندگی تمہارے ساتھ گزارنا چاہوں گی۔"
  },
  {
    "person": "Partner 1",
    "message": "You just made me the happiest person in the world. I promise to love you every single day of my life.",
    "message_urdu": "تم نے مجھے دنیا کا سب سے خوش شخص بنا دیا ہے۔ میں وعدہ کرتا ہوں کہ اپنی زندگی کے ہر دن تم سے محبت کروں گا۔"
  },
  {
    "person": "Partner 2",
    "message": "And I promise to always stand by your side, through everything, forever.",
    "message_urdu": "اور میں وعدہ کرتی ہوں کہ ہمیشہ تمہارے ساتھ کھڑی رہوں گی، ہر چیز میں، ہمیشہ کے لیے۔"
  },
  {
    "person": "Partner 1",
    "message": "I can’t wait to call you my spouse. You are my everything.",
    "message_urdu": "میں تمہیں اپنا شریک حیات کہنے کا بے صبری سے انتظار کر رہا ہوں۔ تم میری سب کچھ ہو۔"
  },
  {
    "person": "Partner 2",
    "message": "And I can’t wait to be your spouse. We’ll make beautiful memories together.",
    "message_urdu": "اور میں تمہاری شریک حیات بننے کا بے صبری سے انتظار کر رہی ہوں۔ ہم ساتھ میں خوبصورت یادیں بنائیں گے۔"
  },
  {
    "person": "Partner 1",
    "message": "I love you more than words can say. I will spend every moment cherishing you.",
    "message_urdu": "میں تم سے اتنی محبت کرتا ہوں جتنی الفاظ بیان نہیں کر سکتے۔ میں ہر لمحہ تمہاری قدر کروں گا۔"
  },
  {
    "person": "Partner 2",
    "message": "And I love you more than anything in this world. You’re my forever.",
    "message_urdu": "اور میں تم سے زیادہ کسی بھی چیز سے محبت کرتی ہوں۔ تم میرا ہمیشہ ہو۔"
  },
  {
    "person": "Partner 1",
    "message": "We’ll make the best team in the world. Our love will never fade.",
    "message_urdu": "ہم دنیا کی سب سے بہترین ٹیم بنائیں گے۔ ہمارا پیار کبھی نہیں مٹے گا۔"
  },
  {
    "person": "Partner 2",
    "message": "I’m excited for our future. We will face everything together.",
    "message_urdu": "میں ہمارے مستقبل کے لیے پرجوش ہوں۔ ہم سب کچھ ساتھ مل کر کریں گے۔"
  },
  {
    "person": "Partner 1",
    "message": "With you by my side, I feel invincible. I can’t wait for this beautiful journey ahead.",
    "message_urdu": "تم میرے ساتھ ہو تو مجھے کچھ بھی ناممکن نہیں لگتا۔ میں اس خوبصورت سفر کے لیے بے صبری سے انتظار کر رہا ہوں۔"
  },
  {
    "person": "Partner 2",
    "message": "I feel the same way. I’m ready for everything that comes our way, as long as we’re together.",
    "message_urdu": "میں بھی یہی محسوس کرتی ہوں۔ میں ہر چیز کے لیے تیار ہوں جو ہماری راہ میں آئے، جب تک ہم ساتھ ہوں۔"
  },
  {
    "person": "Partner 1",
    "message": "This is just the beginning of our beautiful life together.",
    "message_urdu": "یہ ہمارے خوبصورت زندگی کے آغاز کا لمحہ ہے۔"
  },
  {
    "person": "Partner 2",
    "message": "And it’s going to be an amazing journey. With you, everything is perfect.",
    "message_urdu": "اور یہ ایک شاندار سفر ہونے والا ہے۔ تمہارے ساتھ، سب کچھ کامل ہے۔"
  }
]
