[
  {
    "person": "Shoaib",
    "message": "I can't stop thinking about you, you're always on my mind.",
    "message_urdu": "میں تمہیں سوچتے ہوئے رک نہیں پاتا، تم ہمیشہ میرے دماغ میں رہتی ہو۔"
  },
  {
    "person": "Nisha",
    "message": "You make my heart skip a beat every time you smile. I feel so lucky to have you.",
    "message_urdu": "تمہاری مسکراہٹ سے میرا دل ایک دھڑکن چھوڑ دیتا ہے۔ مجھے خوشی ہے کہ تم میری زندگی میں ہو۔"
  },
  {
    "person": "Shoaib",
    "message": "You're my everything. Without you, nothing makes sense.",
    "message_urdu": "تم میری سب کچھ ہو۔ تمہارے بغیر کچھ بھی معنی نہیں رکھتا۔"
  },
  {
    "person": "Nisha",
    "message": "I feel the same way. You're the most important person in my life, and I can't imagine my future without you.",
    "message_urdu": "میں بھی ایسا ہی محسوس کرتی ہوں۔ تم میری زندگی کا سب سے اہم شخص ہو، اور تمہارے بغیر میں اپنے مستقبل کا تصور نہیں کر سکتی۔"
  },
  {
    "person": "Shoaib",
    "message": "Every moment with you feels like a dream come true. I'm so grateful for you.",
    "message_urdu": "تمہارے ساتھ ہر لمحہ ایسا لگتا ہے جیسے خواب سچ ہو گئے ہوں۔ میں تمہارا بہت شکر گزار ہوں۔"
  },
  {
    "person": "Nisha",
    "message": "Being with you feels like home. Your love is the best thing that ever happened to me.",
    "message_urdu": "تمہارے ساتھ ہونا ایسے لگتا ہے جیسے گھر میں ہوں۔ تمہارا پیار میرے لیے سب سے بہترین چیز ہے جو کبھی بھی ہوئی۔"
  },
  {
    "person": "Shoaib",
    "message": "I promise to always be there for you, through the good and the bad.",
    "message_urdu": "میں وعدہ کرتا ہوں کہ میں ہمیشہ تمہارے ساتھ رہوں گا، اچھے اور برے وقت میں۔"
  },
  {
    "person": "Nisha",
    "message": "And I promise to love you endlessly, no matter what happens.",
    "message_urdu": "اور میں وعدہ کرتی ہوں کہ میں تم سے ہمیشہ محبت کروں گی، چاہے جو کچھ بھی ہو۔"
  },
  {
    "person": "Shoaib",
    "message": "When I look into your eyes, I see my whole world. You're everything I ever wanted.",
    "message_urdu": "جب میں تمہاری آنکھوں میں دیکھتا ہوں، مجھے ساری دنیا نظر آتی ہے۔ تم وہ سب کچھ ہو جو میں چاہتا تھا۔"
  },
  {
    "person": "Nisha",
    "message": "I feel the same way. You're the reason I smile every day.",
    "message_urdu": "میں بھی یہی محسوس کرتی ہوں۔ تم وہ وجہ ہو جس سے میں ہر دن مسکراتی ہوں۔"
  },
  {
    "person": "Shoaib",
    "message": "I wish I could hold you forever, never letting go.",
    "message_urdu": "کاش میں تمہیں ہمیشہ کے لیے گلے لگا سکتا، کبھی نہ چھوڑوں۔"
  },
  {
    "person": "Nisha",
    "message": "That sounds perfect. I never want to be apart from you.",
    "message_urdu": "یہ بہت خوبصورت لگتا ہے۔ میں کبھی بھی تم سے دور نہیں ہونا چاہتی۔"
  },
  {
    "person": "Shoaib",
    "message": "Every day with you is a gift, and I will cherish it forever.",
    "message_urdu": "تمہارے ساتھ ہر دن ایک تحفہ ہے، اور میں اسے ہمیشہ کے لیے قدر کروں گا۔"
  },
  {
    "person": "Nisha",
    "message": "I’ll treasure every moment we have together. You’re the love of my life.",
    "message_urdu": "میں ہر لمحہ جو ہم ساتھ گزاریں گے، اس کی قدر کروں گی۔ تم میری زندگی کی محبت ہو۔"
  },
  {
    "person": "Shoaib",
    "message": "I can't wait to spend the rest of my life with you.",
    "message_urdu": "مجھے تمہارے ساتھ اپنی باقی زندگی گزارنے کا بے صبری سے انتظار ہے۔"
  },
  {
    "person": "Nisha",
    "message": "Neither can I. Let’s make beautiful memories together.",
    "message_urdu": "میں بھی نہیں۔ آئیے ہم ساتھ مل کر خوبصورت یادیں بنائیں۔"
  },
  {
    "person": "Shoaib",
    "message": "You are my heart, my soul, my everything.",
    "message_urdu": "تم میرا دل ہو، میری روح ہو، میری سب کچھ ہو۔"
  },
  {
    "person": "Nisha",
    "message": "And you are my forever. I love you more than words can say.",
    "message_urdu": "اور تم میرا ہمیشہ ہو۔ میں تم سے زیادہ محبت کرتی ہوں جتنا الفاظ بیان کر سکتے ہیں۔"
  }
]
