[
  {
    "person": "Partner 1",
    "message": "I’ve been imagining our wedding day for so long. What do you think it will be like?",
    "message_urdu": "میں ہماری شادی کے دن کے بارے میں بہت عرصے سے سوچ رہا ہوں۔ تمہیں کیا لگتا ہے، وہ دن کیسا ہوگا؟"
  },
  {
    "person": "Partner 2",
    "message": "I imagine it will be magical, just like a fairy tale. Everything perfect, with all our loved ones there.",
    "message_urdu": "مجھے لگتا ہے کہ یہ جادوئی ہوگا، جیسے کوئی پریوں کی کہانی۔ سب کچھ کامل ہوگا، اور ہمارے تمام عزیز وہاں ہوں گے۔"
  },
  {
    "person": "Partner 1",
    "message": "I want it to be intimate, with just close family and friends. What do you think about that?",
    "message_urdu": "میں چاہتا ہوں کہ یہ صرف قریبی خاندان اور دوستوں کے ساتھ ایک نجی موقع ہو۔ تمہیں کیا لگتا ہے؟"
  },
  {
    "person": "Partner 2",
    "message": "I think that sounds perfect. I’ve always preferred smaller weddings where the focus is on the people you love.",
    "message_urdu": "مجھے لگتا ہے کہ یہ کامل ہوگا۔ میں ہمیشہ چھوٹی شادیوں کو ترجیح دیتا ہوں جہاں توجہ صرف تمہارے پسندیدہ لوگوں پر ہو۔"
  },
  {
    "person": "Partner 1",
    "message": "I want the ceremony to be outdoors, surrounded by nature. Imagine exchanging vows under the stars.",
    "message_urdu": "میں چاہتا ہوں کہ تقریب کھلے آسمان کے نیچے ہو، قدرت سے گھری ہوئی۔ سوچو کہ ہم وعدے ستاروں کے نیچے کریں۔"
  },
  {
    "person": "Partner 2",
    "message": "That sounds so romantic. I love the idea of a sunset wedding by the beach, with the waves crashing in the background.",
    "message_urdu": "یہ بہت رومانوی لگتا ہے۔ مجھے ساحل پر سورج غروب کے وقت شادی کا خیال پسند ہے، جب لہریں پیچھے ٹوٹ رہی ہوں۔"
  },
  {
    "person": "Partner 1",
    "message": "And the decorations! I’ve always dreamed of elegant, soft tones like ivory and blush pink for the flowers.",
    "message_urdu": "اور سجاوٹ! میں ہمیشہ خواب دیکھتا ہوں کہ پھولوں کے لیے نرم رنگ جیسے ہاتھی دانت اور گلابی پنک ہوں۔"
  },
  {
    "person": "Partner 2",
    "message": "Yes, and lots of fairy lights! It would create such a magical atmosphere.",
    "message_urdu": "ہاں، اور بہت ساری پریوں کی روشنی! یہ ایک جادوئی ماحول پیدا کرے گا۔"
  },
  {
    "person": "Partner 1",
    "message": "I also want a live band playing our favorite songs. Imagine dancing to our song as newlyweds.",
    "message_urdu": "میں چاہتا ہوں کہ ایک لائیو بینڈ ہمارے پسندیدہ گانے بجائے۔ سوچو کہ ہم اپنی شادی کے بعد اپنے گانے پر رقص کریں۔"
  },
  {
    "person": "Partner 2",
    "message": "That would be amazing! Maybe we could write our own vows too, something personal and meaningful.",
    "message_urdu": "یہ شاندار ہوگا! شاید ہم اپنے وعدے خود لکھیں، کچھ ذاتی اور معانی کے ساتھ۔"
  },
  {
    "person": "Partner 1",
    "message": "Definitely! I think our vows should reflect how much we’ve grown together and what we mean to each other.",
    "message_urdu": "یقیناً! میں سمجھتا ہوں کہ ہمارے وعدے یہ دکھانے چاہئیں کہ ہم ایک دوسرے کے ساتھ کتنی ترقی کر چکے ہیں اور ہم ایک دوسرے کے لیے کتنے اہم ہیں۔"
  },
  {
    "person": "Partner 2",
    "message": "I can’t wait for that moment. And I would love a grand reception after, with everyone celebrating with us.",
    "message_urdu": "مجھے اس لمحے کا بے صبری سے انتظار ہے۔ اور پھر ایک عظیم استقبال بھی ہونا چاہیے، جہاں سب ہمارے ساتھ جشن منائیں۔"
  },
  {
    "person": "Partner 1",
    "message": "For the reception, we can have a mix of traditional and modern elements. Maybe even a first dance that blends our cultures.",
    "message_urdu": "استقبال کے لیے، ہم روایتی اور جدید عناصر کا مجموعہ کر سکتے ہیں۔ شاید ہم اپنا پہلا رقص ایسا رکھیں جو ہمارے ثقافتوں کو ملا دے۔"
  },
  {
    "person": "Partner 2",
    "message": "I love that idea! It would be so beautiful to celebrate both of our backgrounds.",
    "message_urdu": "مجھے یہ خیال بہت پسند آیا! یہ دونوں ہمارے پس منظر کا جشن منانے کے لیے بہت خوبصورت ہوگا۔"
  },
  {
    "person": "Partner 1",
    "message": "I also picture us having a long honeymoon, maybe somewhere tropical with beautiful beaches and clear blue water.",
    "message_urdu": "میں یہ بھی سوچتا ہوں کہ ہماری طویل ہنی مون ہو، شاید کہیں ایسا مقام جہاں خوبصورت ساحل ہوں اور نیلا صاف پانی ہو۔"
  },
  {
    "person": "Partner 2",
    "message": "A tropical honeymoon sounds perfect. Somewhere we can relax and enjoy each other’s company.",
    "message_urdu": "تروپیکل ہنی مون بہترین لگتا ہے۔ کہیں ایسا جگہ جہاں ہم آرام کریں اور ایک دوسرے کی صحبت کا لطف اٹھائیں۔"
  },
  {
    "person": "Partner 1",
    "message": "I want our wedding day to be unforgettable. A day that marks the beginning of the rest of our lives together.",
    "message_urdu": "میں چاہتا ہوں کہ ہماری شادی کا دن ناقابل فراموش ہو۔ ایک ایسا دن جو ہماری زندگی کے باقی حصے کی شروعات ہو۔"
  },
  {
    "person": "Partner 2",
    "message": "It will be unforgettable, I promise you that. And the rest of our lives will be even more beautiful.",
    "message_urdu": "یہ ناقابل فراموش ہوگا، میں تم سے وعدہ کرتا ہوں۔ اور ہماری باقی زندگی اور بھی خوبصورت ہوگی۔"
  },
  {
    "person": "Partner 1",
    "message": "I can’t wait to say ‘I do’ to you. To spend forever with you.",
    "message_urdu": "مجھے تم سے 'میں ہاں کہتا ہوں' کہنے کا بے صبری سے انتظار ہے۔ تمہارے ساتھ ہمیشہ گزارنے کے لیے۔"
  },
  {
    "person": "Partner 2",
    "message": "And I can’t wait to say ‘I do’ to you either. We’re going to create the most beautiful life together.",
    "message_urdu": "اور مجھے بھی تم سے 'میں ہاں کہتی ہوں' کہنے کا بے صبری سے انتظار ہے۔ ہم ایک ساتھ سب سے خوبصورت زندگی تخلیق کریں گے۔"
  }
]
